TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_spgss.h
/* SPGSS_DMACHAIN0 Bits */
/* SPGSS_DMACHAIN0[SEL] Bits */
#define SPGSS_DMACHAIN0_SEL_OFS                  (1)                             /* !< SEL Offset */
#define SPGSS_DMACHAIN0_SEL_MASK                 ((uint32_t)0x0000003EU)         /* !< Select FIFO for chain */
#define SPGSS_DMACHAIN0_SEL_SPG1RXDONE           ((uint32_t)0x00000000U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG2RXDONE           ((uint32_t)0x00000002U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG3RXDONE           ((uint32_t)0x00000004U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG4RXDONE           ((uint32_t)0x00000006U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG5RXDONE           ((uint32_t)0x00000008U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG6RXDONE           ((uint32_t)0x0000000AU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG7RXDONE           ((uint32_t)0x0000000CU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG8RXDONE           ((uint32_t)0x0000000EU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG9RXDONE           ((uint32_t)0x00000010U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG10RXDONE          ((uint32_t)0x00000012U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG11RXDONE          ((uint32_t)0x00000014U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG12RXDONE          ((uint32_t)0x00000016U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG13RXDONE          ((uint32_t)0x00000018U)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG14RXDONE          ((uint32_t)0x0000001AU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG15RXDONE          ((uint32_t)0x0000001CU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG16RXDONE          ((uint32_t)0x0000001EU)         /* !< SPG DMA RX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from RX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG1TXDONE           ((uint32_t)0x00000020U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG2TXDONE           ((uint32_t)0x00000022U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG3TXDONE           ((uint32_t)0x00000024U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG4TXDONE           ((uint32_t)0x00000026U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG5TXDONE           ((uint32_t)0x00000028U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG6TXDONE           ((uint32_t)0x0000002AU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG7TXDONE           ((uint32_t)0x0000002CU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG8TXDONE           ((uint32_t)0x0000002EU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG9TXDONE           ((uint32_t)0x00000030U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG10TXDONE          ((uint32_t)0x00000032U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG11TXDONE          ((uint32_t)0x00000034U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG12TXDONE          ((uint32_t)0x00000036U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG13TXDONE          ((uint32_t)0x00000038U)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG14TXDONE          ((uint32_t)0x0000003AU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG15TXDONE          ((uint32_t)0x0000003CU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
#define SPGSS_DMACHAIN0_SEL_SPG16TXDONE          ((uint32_t)0x0000003EU)         /* !< SPG DMA TX Done Raw Interrupt
                                                                                    Status.  DMA_DONE from TX is selected
                                                                                    as a trigger for global DMA */
/* SPGSS_DMACHAIN0[EN] Bits */
#define SPGSS_DMACHAIN0_EN_OFS                   (0)                             /* !< EN Offset */
#define SPGSS_DMACHAIN0_EN_MASK                  ((uint32_t)0x00000001U)         /* !< Enable chain */
#define SPGSS_DMACHAIN0_EN_DISABLE               ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define SPGSS_DMACHAIN0_EN_ENABLE                ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

